//#include "pch.h"
#include "MyString.h"
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	MyString popa = "НА ТЕПЛОХОДЕ МУЗЫКА ИГРАЛА";
	MyString popa2 = "А Я СТОЮ НА БЕРЕГУ";
	popa += popa2;
	popa2 = popa;
	if (popa2 == popa) {
		//popa2.reverse();
		cout << popa + " " + popa2 + " \n";
	}
	popa2.reverse();
	cout << popa2 + "\n";
	for (int i = 0; i < popa.size(); i++) {
		cout << popa[i];
	}
	popa.numberGET();
	getchar();
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
